# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie' # Better curl
brew 'mackup'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Development
brew 'yarn'
brew 'python'
brew 'poetry'

# Apps
## Misc
cask 'caffeine'
cask 'deepl'
cask 'gpg-suite'
cask 'imageoptim'
cask 'spotmenu'
cask 'vmware-fusion'

## Password Managers
cask '1password'
cask 'lastpass'

## VPN
cask 'nordvpn'
cask 'tunnelblick'

## Browser
cask 'firefox'
cask 'google-chrome'

# Development
cask 'pycharm'
cask 'webstorm'
cask 'android-studio'
cask 'visual-studio-code'
cask 'tableplus'
cask 'docker'

# Messenger
cask 'signal'
cask 'slack'
cask 'telegram-desktop'
cask 'whatsapp'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
